Q1. List any five functions of the pandas library with execution.

1. read_csv()
 - This is one of the most crucial pandas methods in Python. read_csv() function helps read a comma-separated values (csv) file into a Pandas DataFrame. All you need to do is mention the path of the file you want it to read. It can also read files separated by delimiters other than comma, like | or tab. 
2. head()
- head() is used to return the first n rows of a dataset. By default, df.head() will return the first 5 rows of the DataFrame. If you want more/less number of rows, you can specify n as an integer.
3. describe()
- describe() is used to generate descriptive statistics of the data in a Pandas DataFrame or Series. It summarizes central tendency and dispersion of the dataset. describe() helps in getting a quick overview of the dataset. 
4. memory_usage()
- memory_usage() returns a Pandas Series having the memory usage of each column (in bytes) in a Pandas DataFrame. By specifying the deep attribute as True, we can get to know the actual space being taken by each column. 
5. loc[:]
- loc[:] helps to access a group of rows and columns in a dataset, a slice of the dataset, as per our requirement. For instance, if we only want the last 2 rows and the first 3 columns of a dataset, we can access them with the help of loc[:]. We can also access rows and columns based on labels instead of row and column number.

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [32]:
import pandas as pd

data = {
  "age": [50, 40, 30, 40],
  "qualified": [True, False, False, False]
}
idx = ["Sally", "Mary", "John", "Monica"]
df = pd.DataFrame(data, index=idx)

newidx = ["Robert", "Cindy", "Chloe", "Pete"]
newdf = df.reindex(newidx)
print(newdf)

        age qualified
Robert  NaN       NaN
Cindy   NaN       NaN
Chloe   NaN       NaN
Pete    NaN       NaN

In [33]:
df

        age  qualified
Sally    50       True
Mary     40      False
John     30      False
Monica   40      False

In [34]:
newdf

        age qualified
Robert  NaN       NaN
Cindy   NaN       NaN
Chloe   NaN       NaN
Pete    NaN       NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
- For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [35]:
data1 = {"Values":[10,20,30,40,50]}
df = pd.DataFrame(data1)
print(df)

   Values
0      10
1      20
2      30
3      40
4      50

In [44]:
df1 = df [0:3]

In [47]:
df1.sum()

Values    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [50]:
df4 = pd.DataFrame ({'Text' : ['Lamb Jacob Christian', 'My name is Lamb', 'I am learning Data Science from PW']})

In [51]:
df4

                                 Text
0                Lamb Jacob Christian
1                     My name is Lamb
2  I am learning Data Science from PW

In [55]:
df4['Word_Count'] = df4 ['Text'].apply (lambda x:len(x.split()))
print(df4)

                                 Text  Word_Count
0                Lamb Jacob Christian           3
1                     My name is Lamb           4
2  I am learning Data Science from PW           7

Q5. How are DataFrame.size() and DataFrame.shape() different?

A5. 
# Pandas DataFrame size()
- The size property is used to get an int representing the number of elements in this object and Return the number of rows if Series. Otherwise, return the number of rows times the number of columns if DataFrame.
# Pandas DataFrame shape()
 - The shape property is used to get a tuple representing the dimensionality of the Pandas DataFrame.

Q6. Which function of pandas do we use to read an excel file?

A6. Pandas read_excel() function is used for reading the Excel files. Files can be imported using a URL link or can be directly imported from the disk. There are different parameters like io for path,sheet_name for specifying the name of the sheet, etc., for reading the file.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [56]:
df7 = pd.DataFrame ({'Email' : ['john.doe@example.com', 'lambchristian@hotmail.com']})

In [57]:
df7

                       Email
0       john.doe@example.com
1  lambchristian@hotmail.com

In [58]:
df7['username'] = df7.Email.str.extract("(.*)@")

In [59]:
df7

                       Email       username
0       john.doe@example.com       john.doe
1  lambchristian@hotmail.com  lambchristian

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [60]:
data = {"A" : [3,8,6,2,9],
      "B" : [5,2,9,3,1],
      "C" : [1,7,4,5,2]}
df8 = pd.DataFrame(data)
df8

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [62]:
df8a = df8[(df8["A"]>5) & (df8["B"]<10)]

In [63]:
df8a

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [64]:
data1 = {"Values":[10,20,30,40,50]}
df9 = pd.DataFrame(data1)

In [65]:
df9

   Values
0      10
1      20
2      30
3      40
4      50

In [66]:
df9.mean()

Values    30.0
dtype: float64

In [67]:
df9.median()

Values    30.0
dtype: float64

In [68]:
df9.std()

Values    15.811388
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [69]:
df10 = pd.DataFrame ({'Sales' : [11,22,33,44,55,66,77,88,99],
                     'Date' : ['01/01/2023', '02/01/2023', '03/01/2023', '04/01/2023', '05/01/2023', '06/01/2023', '07/01/2023', '08/01/2023', '09/01/2023']})

In [70]:
df10

   Sales        Date
0     11  01/01/2023
1     22  02/01/2023
2     33  03/01/2023
3     44  04/01/2023
4     55  05/01/2023
5     66  06/01/2023
6     77  07/01/2023
7     88  08/01/2023
8     99  09/01/2023

In [73]:
df10 ['MovingAverage'] = df10 ['Sales'].rolling(window=7).mean()

In [75]:
df10

   Sales        Date  MovingAverage
0     11  01/01/2023            NaN
1     22  02/01/2023            NaN
2     33  03/01/2023            NaN
3     44  04/01/2023            NaN
4     55  05/01/2023            NaN
5     66  06/01/2023            NaN
6     77  07/01/2023           44.0
7     88  08/01/2023           55.0
8     99  09/01/2023           66.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [81]:
dates = pd.date_range(start='2023-01-01', end='2023-01-05')
df11 = pd.DataFrame({'date': dates})
df11['Weekday'] = df11['date'].dt.dayofweek
df11['Weekday'] = df11['Weekday'].map({
    0: 'Monday',
    1: 'Tuesday',
    2: 'Wednesday',
    3: 'Thursday',
    4: 'Friday',
    5: 'Saturday',
    6: 'Sunday'
})

In [82]:
df11

        date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [85]:
dates = pd.date_range(start='2023-01-01', end='2023-01-31')
df12 = pd.DataFrame({'date': dates})

In [87]:
print (df12)

         date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

In [94]:
dt12 = pd.Timedelta (days = 1)

In [96]:
df12 + dt12

         date
0  2023-01-02
1  2023-01-03
2  2023-01-04
3  2023-01-05
4  2023-01-06
5  2023-01-07
6  2023-01-08
7  2023-01-09
8  2023-01-10
9  2023-01-11
10 2023-01-12
11 2023-01-13
12 2023-01-14
13 2023-01-15
14 2023-01-16
15 2023-01-17
16 2023-01-18
17 2023-01-19
18 2023-01-20
19 2023-01-21
20 2023-01-22
21 2023-01-23
22 2023-01-24
23 2023-01-25
24 2023-01-26
25 2023-01-27
26 2023-01-28
27 2023-01-29
28 2023-01-30
29 2023-01-31
30 2023-02-01

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

A13. "import pandas as pd"

# Respacted Sir. Please Share Image Scraping Assignment Solution file on "lambchristian@hotmail.com". Because I can't perform on Youtube. I can perform on other website like flipkart, Amazone etc. I want to learn image scraping operation on Youtube also. Please share solution file. Thank you so much.